import one from './img/1.webp'
import two from './img/2.webp'
import three from './img/3.webp'
import four from './img/4.webp'
import five from './img/5.webp'
import six from './img/6.webp'
import seven from './img/7.webp'
import eight from './img/8.webp'
import nine from './img/9.webp'
import ten from './img/10.webp'
import eleven from './img/11.webp'
import twelve from './img/12.webp'
import threteen from './img/13.webp'
import fourteen from './img/14.webp'
import fiveteen from './img/15.webp'
import sixteen from './img/16.webp'
import seventeen from './img/17.webp'
import eighteen from './img/18.webp'
import nineteen from './img/19.webp'
import twenty from './img/20.webp'
import twentyOne from './img/21.webp'
import twentyTwo from './img/22.webp'
import twentyThree from './img/23.webp'
import twentyFour from './img/24.webp'
import twentyFive from './img/25.webp'


export const arrayOfBooks = [
    {
        id: 1,
        img: one,
        name: '1984',
        author: 'Джордж Оруэл',
        genre: 'classic',
        price: '577',
        description: 'По Оруэллу, нет и не может быть ничего ужаснее тотальной несвободы. Тоталитаризм уничтожает в человеке все духовные потребности, мысли, чувства и сам разум, оставляя лишь постоянный страх и единственный выбор – между молчанием и смертью, и если Старший Брат смотрит на тебя и заявляет, что «дважды два – пять», значит, так и есть.'

    },

    {
        id: 2,
        img: two,
        name: 'Три товарища',
        author: 'Эрих Мария Ремарк',
        genre: 'classic',
        price: '679',
        description: 'Первая мировая война осталась позади. В разбитой, униженной, обескровленной Германии царит уныние. Молодые люди, которым посчастливилось вернуться с фронта живыми, не могут ни избавиться от страшных воспоминаний, ни найти себе место в изменившемся мире. Именно их впоследствии назовут "потерянным поколением".\n' +
            'В этой мрачной атмосфере трое друзей, Робби, Отто и Готфрид, стараются держаться на плаву и не падать духом. Когда они знакомятся с очаровательной Патрицией Хольман, в жизнь Робби врывается любовь, разгоняющая мрак. Впереди новые испытания, война и годы спустя продолжает калечить судьбы. Но если человека от нее не спасти, можно сказать ей "нет", сохраняя в себе человеческое - бескорыстие, мужество, преданность. Через несколько лет Эрих Мария Ремарк будет вынужден эмигрировать, а его произведения публично сожгут нацисты. Однако Ремарк навсегда останется одним из важнейших немецких писателей двадцатого столетия, а "Три товарища" - книгой, которую любят, читают и перечитывают во всем мире.'

    },

    {
        id: 3,
        img: three,
        name: 'Отцы и дети',
        author: 'Иван Сергеевич Тургенев',
        genre: 'classic',
        price: '535',
        description: 'Споры главного героя Евгения Базарова, называающего себя нигилистом и отрицающего расхожие представления о жизни, искусстве, морали, природе человека, и его антагониста Павла Кирсанова, аристократа до мозга костей, состаляют главную проблематику романа.\n' +
            'Но сюжетная канва строится скорее на внутреннем конфликте самого Базарова. Только что отрицавший все и вся герой, не веривший в любовь, смеявшийся над своим приятелем, способным на нежные чувства, вдруг сам страстно и пылко влюбляется.\n' +
            'И все вдруг переворачивается вверх дном — с любовью Базаров совладать не в силах, она оказывается сильнее самых твердых убеждений.'

    },

    {
        id: 4,
        img: four,
        name: 'Портрет Дориана Грея',
        author: 'Оскар Уайльд',
        genre: 'classic',
        price: '577',
        description: 'Главный герой романа, красавец Дориан, — фигура двойственная, неоднозначная. Тонкий эстет и романтик становится безжалостным преступником. Попытка сохранить свою необычайную красоту и молодость оборачивается провалом. Вместо героя стареет его портрет — но это не может продолжаться вечно, и смерть Дориана расставляет все по своим местам.'

    },

    {
        id: 5,
        img: five,
        name: 'Мартин Иден',
        author: 'Джек Лондон',
        genre: 'classic',
        price: '594',
        description: 'Во многом автобиографическая книга о человеке, который "сделал себя сам", выбравшись из самых низов, добился признания. Любовь к девушке из высшего общества побуждает героя заняться самообразованием. Он становится писателем, но все издательства отказывают ему в публикации.\n' +
            'И как это часто бывает в жизни, пройдя сквозь лишения и унижения, получив отказ от любимой девушки, он наконец становится знаменитым. Но ни слава, ни деньги, ни успех, ни даже возвращение его возлюбленной не могут уберечь Мартина от разочарования в этой насквозь фальшивой жизни.'

    },

    {
        id: 6,
        img: six,
        name: 'Кладбище домашних животных',
        author: 'Стивен Кинг',
        genre: 'fantasy',
        price: '620',
        description: 'Казалось бы, семейство Крид — это настоящее воплощение «американской мечты»: отец — преуспевающий врач, красавица мать, прелестные дети. Для полной идиллии им не хватает лишь большого старинного дома, куда они вскоре и переезжают.\n' +
            'Но идиллия вдруг стала превращаться в кошмар. Потому что в окружающих их новое жилище вековых лесах скрывается НЕЧТО, более ужасное, чем сама смерть и… более могущественное.'

    },

    {
        id: 7,
        img: seven,
        name: 'Понедельник начинается в субботу',
        author: 'Аркадий и Борис Стругацкие',
        genre: 'fantasy',
        price: '594',
        description: '«Понедельник начинается в субботу. Сказка для научных работников младшего возраста» – под таким заголовком в 1965 году вышла книга, которой зачитывались и продолжают зачитываться все новые и новые поколения. Герои ее, сотрудники НИИЧАВО, – Научно-исследовательского института Чародейства и Волшебства, – маги и магистры, молодые энтузиасты, горящие желанием познать мир и преобразовать его наилучшим образом. На этом пути их ждет множество удивительных приключений и поразительных открытий. Машина времени и изба на курьих ножках, выращивание искусственного человека и усмирение выпущенного из бутылки джинна – читатель не заскучает!'

    },

    {
        id: 8,
        img: eight,
        name: 'Дюна',
        author: 'Фрэнк Герберт',
        genre: 'fantasy',
        price: '1499',
        description: 'Действие романа происходит в далеком будущем, посреди разросшейся феодальной межгалактической империи, где планетарные вотчины контролируются благородными семействами, верными Императорскому дому Коррино.\n' +
            '\n' +
            'В центре повествования – молодой Пол Атрейдес, наследник герцога Лето Атрейдеса. Семья переезжает на планету Арракис, единственный во вселенной источник пряностей-меланжа. Автор создает масштабное полотно, где отображены сложные политические, религиозные, экологические, технологические вопросы. Здесь тесно переплетаются судьбы самого Пола, его семьи, коренных жителей Арракиса, Императора, могущественных гильдий и орденов. Великое противостояние сильных мира сего ведет к глобальным переменам, которые затронут все человечество.'

    },

    {
        id: 9,
        img: nine,
        name: 'Сияние',
        author: 'Стивен Кинг',
        genre: 'fantasy',
        price: '620',
        description: 'Писатель Джек Торренс устраивается на зиму работать смотрителем роскошного отеля «Оверлук», расположенного вблизи снежных горных вершин. Для мужчины это – отличная возможность закончить работу над своим романом, а еще провести время с женой и сыном.\n' +
            '\n' +
            'На собеседовании владелец гостиницы рассказывает главному герою о том, что предыдущий смотритель после пяти месяцев работы в отеле помешался и убил свою жену и двух дочерей. Но Джека это совершенно не пугает.\n' +
            '\n' +
            'Семейство Торренсов благополучно въезжает в отель. И здание, будто живой организм, начинает испытывать своих постояльцев на прочность.\n' +
            '\n' +
            'Кто сможет пережить пять месяцев в снежной пустыне? И действительно ли Джек впервые оказался посетителем отеля «Оверлук»?'

    },

    {
        id: 10,
        img: ten,
        name: 'Задача трех тел',
        author: 'Лю Цысинь',
        genre: 'fantasy',
        price: '859',
        description: 'Когда они придут — Земля вновь станет гармоничным и процветающим миром…\n' +
            '\n' +
            'Китай охвачен хаосом «культурной революции». Несмотря на это, в ходе секретного военного проекта, в космос отправлялись сигналы с целью обнаружения инопланетного разума. Проект завершился успехом, и один из сигналов приняла иная цивилизация. Вот только чужие находятся на краю гибели и Земля кажется идеальной для вторжения.\n' +
            'В ожидании прибытия «гостей» часть человечества готова сдать инопланетянам Землю, чтобы те изменили порочный мир к лучшему. Другие же готовы бороться против вторжения до последнего.\n'

    },

    {
        id: 11,
        img: eleven,
        name: 'Десять негритят',
        author: 'Агата Кристи',
        genre: 'detective',
        price: '331',
        description: 'Десять никак не связанных между собой людей в особняке на уединенном острове... Кто вызвал их сюда таинственным приглашением? Зачем кто-то убивает их, одного за другим, самыми невероятными способами? Почему все происходящее так тесно переплетено с веселым детским стишком?'

    },

    {
        id: 12,
        img: twelve,
        name: 'Граф Аверин. Колдун Российской империи',
        author: 'Виктор Дашкевич',
        genre: 'detective',
        price: '729',
        description: 'Магический Петербург, 1982 год.\n' +
            'Граф Аверин расследует убийство дворянского сына, в котором обвиняют дивов, жестоких магических существ из Пустоши. Они подчиняются людям, но выходят из-под контроля, стоит почувствовать кровь или слабость хозяина.\n' +
            'Аверин понимает, что это не первое убийство и за преступлениями стоит очень сильный див. В то же время на Петроградке появляется огромный демонический кот...'

    },

    {
        id: 13,
        img: threteen,
        name: 'Каштановый человечек',
        author: 'Сорен Свейструп',
        genre: 'detective',
        price: '662',
        description: 'Копенгаген. Найдено тело жестоко убитой девушки. Над ним висит каштановый человечек — куколка, сделанная из каштанов и спичек, с прорезанными глазками и улыбающимся ротиком. На фигурке обнаружены отпечатки пальцев пропавшей год назад и числящейся мертвой девочки. Но человек, признавшийся в ее убийстве, уже сидит в тюрьме. А вскоре находят еще один труп — и снова следователям улыбается каштановый человечек с отпечатками пальцев той же мертвой девочки…'

    },

    {
        id: 14,
        img: fourteen,
        name: 'Хороших девочек не убивают',
        author: 'Холли Джексон',
        genre: 'detective',
        price: '699',
        description: 'Пять лет назад популярную школьную красавицу Энди Белл убил ее парень Сэл Сингх, а сознавшись в содеянном, покончил с собой. Дело закрыто. Полиция знает, что это сделал Сэл. Весь город знает…\n' +
            '\n' +
            'Но ученица местной школы Пиппа Фитц-Амоби с ними не согласна. Она выбирает эту жуткую трагедию в качестве темы для своего выпускного проекта. Вместе с братом Сэла, вооружившись ноутбуком, диктофоном и большим желанием докопаться до истины, Пиппа начинает свое расследование.\n' +
            '\n' +
            'Однако не все хотят, чтобы темные тайны прошлого были раскрыты…'

    },

    {
        id: 15,
        img: fiveteen,
        name: 'Тайная история',
        author: 'Донна Тартт',
        genre: 'detective',
        price: '1399',
        description: 'Действие происходит в небольшом колледже в Вермонте, куда девятнадцатилетний Ричард Пейпен приезжает изучать древнегреческий язык. Новые друзья Ричарда — четверо молодых людей и одна девушка — умны, раскованны, богаты и так увлечены античной культурой, что рассматривают себя чуть ли не как особую касту ее хранителей. Их дружба не выдерживает, однако, натиска современного мира. В веселой и сплоченной компании происходит убийство. Пытаясь через много лет осмыслить случившееся, герой по дням воспроизводит свою студенческую жизнь, этапы отношений с однокурсниками и любимой девушкой, и под виртуозным пером Донны Тартт его исповедь превращается в захватывающий психологический триллер.'

    },

    {
        id: 16,
        img: sixteen,
        name: 'Спеши любить',
        author: 'Николас Спакр',
        genre: 'romance',
        price: '535',
        description: 'Тихий городок Бофор.\n' +
            'Каждый год Лэндон Картер приезжает сюда, чтобы вспомнить историю своей первой любви…\n' +
            'Историю страсти и нежности, много лет назад связавшей его, парня из богатой семьи, и Джейми Салливан, скромную дочь местного пастора.\n' +
            'История радости и грусти, счастья и боли.\n' +
            'Историю чувства, которое человеку доводится испытать лишь раз в жизни – и запомнить навсегда...'

    },

    {
        id: 17,
        img: seventeen,
        name: 'Поющие в терновнике',
        author: 'Колин Маккалоу',
        genre: 'romance',
        price: '832',
        description: 'Девятилетняя Мэгги Клири впервые увидела преподобного Ральфа де Брикассара в 1921 году, когда переехала с мамой, папой и братьями из Новой Зеландии в Австралию. Мэри Карсон, богатая сестра трудолюбивого, но нищего Патрика Клири, пригласила его со всей семьей в Дрохеду, предложив должность старшего овчара.\n' +
            '\n' +
            'Так началась странная история любви длиною в жизнь. Поначалу Ральф относился к Мэгги как к младшей сестренке. Повзрослев, девушка отчаянно влюбилась в священника. А тот не мог ответить взаимностью, хотя тоже полюбил рыжеволосую красавицу. Ведь он дал обет целомудрия.\n' +
            '\n' +
            'От отчаяния Мэгги вышла замуж, родила дочь. Но не могла забыть Ральфа де Брикассара. И однажды судьба подарила ей шанс стать счастливой…\n' +
            '\n' +
            'Параллельно разворачиваются истории каждого из многочисленных членов семьи Клири – Фионы, Патрика, их первенца Фрэнка и остальных детей. Почему утонченная аристократка Фиа Армстронг вышла замуж за бедняка Пэдди? На кого похож Фрэнк и почему отец относится к нему с предубеждением? Какая судьба ждет Боба, Джека, Хьюго, Стюарта и других мальчиков Клири? И правда ли, что все лучшее в этой жизни покупается только ценой великого страдания?..'

    },

    {
        id: 18,
        img: eighteen,
        name: 'Из Лондона с любовью',
        author: 'Сара Джио',
        genre: 'romance',
        price: '637',
        description: 'Наши дни. Валентина узнает, что ее мать Элоиза оставила ей в наследство дом в Лондоне. Отношения с матерью у Валентины разладились уже давно, поэтому она не заинтересована в наследстве. Но обнаруживается, что в доме находится книжный магазин, рядом живут симпатичные соседи и у Элоизы была от дочери тайна, которую Валентина начинает разгадывать, находя от матери многозначительные подсказки.\n' +
            '1968 год. Элоиза делит съемную квартиру с подругой и мечтает открыть книжный магазин. Однажды она знакомится с Эдвардом – как ей кажется, очень приятным, но загадочным молодым человеком. Увы, после одной из встреч Эдвард исчезает. Это становится поворотным моментом в судьбе Элоизы, о чем поначалу не подозревает даже она сама.'

    },

    {
        id: 19,
        img: nineteen,
        name: 'Среди тысячи слов',
        author: 'Эмма Скотт',
        genre: 'romance',
        price: '679',
        description: 'Уиллоу пережила тяжелую душевную травму и сбегает от жизни на страницы книг. Она хочет получить роль, чтобы изгнать своих демонов и обрести спокойствие. Айзек же мечтал обрести свой собственный голос и уехать прочь из этого города. Пока не появилась она.\n' +
            'Как сложится судьба отношений между героями? Смогут ли они быть вместе, когда весь мир настроен против них? Эмоции, которые проживут на сцене Айзек и Уиллоу, станут отражением их чувств друг к другу.\n' +
            'Книга станет незаменимым источником поддержки для всех, кто пережил эмоциональное или физическое насилие. А строки Шекспира помогут обрести свой внутренний голос и силу, побеждающую все травмы и боль.'

    },

    {
        id: 20,
        img: twenty,
        name: 'До встречи с тобой',
        author: 'Джоджо Моейс',
        genre: 'romance',
        price: '662',
        description: 'Лу Кларк знает, сколько шагов от автобусной остановки до ее дома. Она знает, что ей очень нравится работа в кафе и что, скорее всего, она не любит своего бойфренда Патрика. Но Лу не знает, что вот-вот потеряет свою работу и что в ближайшем будущем ей понадобятся все силы, чтобы преодолеть свалившиеся на нее проблемы.\n' +
            'Уилл Трейнор знает, что сбивший его мотоциклист отнял у него желание жить. И он точно знает, что надо сделать, чтобы положить конец всему этому. Но он не знает, что Лу скоро ворвется в его мир буйством красок. И они оба не знают, что навсегда изменят жизнь друг друга.'

    },

    {
        id: 21,
        img: twentyOne,
        name: 'Дети капитана Гранта',
        author: 'Жюль Верн',
        genre: 'adventure',
        price: '934',
        description: 'В водах Шотландии поймана рыба-молот, внутри которой обнаружена бутылка с загадочными письмами на трех языках. Те несколько слов, которые удалось прочесть, вселяют уверенность в том, что автор этих писем — давно исчезнувший капитан Грант. Этого оказалось достаточно, чтобы яхта «Дункан» под командованием отважного лорда Гленарвана отправилась в кругосветное плавание навстречу незабываемым приключениям в поисках разгадки таинственного исчезновения капитана.'

    },

    {
        id: 22,
        img: twentyTwo,
        name: 'Гардемарины, вперед',
        author: 'Нина Соротокина',
        genre: 'adventure',
        price: '1444',
        description: 'Россия, XVIII век. Трое воспитанников навигацкой школы — Александр Белов, Алеша Корсак и Никита Оленев — по стечению обстоятельств оказались вовлечены в дела государственной важности. На карту поставлено многое: и жизнь, и любовь, и честь российской короны. Друзья мечтали о приключениях и славе, и вот теперь им на деле предстоит испытать себя и сыграть в опасную игру с великими мира сего, окунувшись в пучину дворцовых интриг и политических заговоров. И какие бы испытания ни посылала им судьба, гардемарины всегда остаются верны дружбе и следуют своему главному девизу: «Жизнь Родине, честь — никому!» Захватывающий сюжет, полный опасных приключений и неожиданных поворотов, разворачивается на фоне одной из самых интересных эпох российской истории, во времена правления императрицы Елизаветы, дочери Петра Великого. '

    },

    {
        id: 23,
        img: twentyThree,
        name: 'Робинзон Крузо',
        author: 'Даниель Дефо',
        genre: 'adventure',
        price: '305',
        description: 'История человека, сумевшего выжить на необитаемом острове. История его борьбы с безжалостными силами природы и блистательной победы. История его дружбы с благородным дикарем и опасной схватки с пиратами...\n' +
            'Идут века, но имена Робинзона Крузо и его верного Пятницы по-прежнему остаются нарицательными, а увлекательный роман об их приключениях, неоднократно экранизированный, не оставляет равнодушными ни взрослых, ни юных читателей.'

    },

    {
        id: 24,
        img: twentyFour,
        name: 'Приключения капитана Блада',
        author: 'Рафаэль Сабатини',
        genre: 'adventure',
        price: '934',
        description: 'Бакалавр медицины Питер Блад, обвиненный в государственной измене – за то, что, верный клятве Гиппократа, оказал помощь раненному мятежнику, – приговорен к каторжным работам в южных колониях Великобритании. Спустя полгода, совершив дерзкий побег с острова Барбадос на захваченном испанском галеоне, он начинает новую, полную приключений и опасностей жизнь капитана пиратского корабля и вскоре становится легендой берегового братства и грозой Карибского моря. Благородный разбойник, волей судьбы оказавшийся вне закона, но не утративший понятий о добре, чести и справедливости,– таков главный герой увлекательной корсарской одиссеи, поведанной английским писателем Рафаэлем Сабатини.'

    },

    {
        id: 25,
        img: twentyFive,
        name: 'Вокруг света за 80 дней',
        author: 'Жюль Верн',
        genre: 'adventure',
        price: '263',
        description: '«Вокруг света в восемьдесят дней» — увлекательный роман о путешествии вокруг света англичанина Филеаса Фогга и Жана Паспарту, совершенном в результате пари. Для того, чтобы выиграть и обогнуть земной шар за 80 дней, им пришлось пережить опасные и невероятные приключения, побывать на разных континентах и во множестве стран.'

    }
]